Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType
Indicates how the visualization material for the MassSurfaceData is calculated.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType.NormalMaterial
The visualization material for the MassSurfaceData will be taken from the material
associated with the object style of the subcategory of the MassSurfaceData if the
materialId is InvalidElementId, or the MassSurfaceData will use the specific material
indicated by the materialId property if its value is an ElementId of a MaterialElement.

Autodesk.Revit.DB.Analysis.MassSurfaceDataMaterialType.MaterialByConstruction
The visualization material for the MassSurfaceData will be taken from the
material assigned to the ConceptualConstructionType which is assigned to the
MassSurfaceData.